# -*- coding：utf-8 -*-
#中国城市字典表
PROVICE_CITYS_NAME = {"北京":"北京",
"上海":"上海",
"天津":"天津",
"重庆":"重庆",
"黑龙江":"哈尔滨",
"吉林":"长春",
"辽宁":"沈阳",
"内蒙古":"呼和浩特",
"河北":"石家庄",
"新疆":"乌鲁木齐",
"甘肃":"兰州",
"青海":"西宁",
"陕西":"西安",
"宁夏":"银川",
"河南":"郑州",
"山东":"济南",
"山西":"太原",
"安徽":"合肥",
"湖北":"武汉",
"湖南":"长沙",
"江苏":"南京",
"四川":"成都",
"贵州":"贵阳",
"云南":"昆明",
"广西":"南宁",
"西藏":"拉萨",
"浙江":"杭州",
"江西":"南昌",
"广东":"广州",
"福建":"福州",
"台湾":"台北",
"海南":"海口",
"香港":"香港",
"澳门":"澳门"}

SFZ_CITY_IDS = {"11":"北京",
"12":"天津",
"13":"河北",
"14":"山西",
"15":"内蒙古",
"21":"辽宁",
"22":"吉林",
"23":"黑龙江",
"31":"上海",
"32":"江苏",
"33":"浙江",
"34":"安徽",
"35":"福建",
"36":"江西",
"37":"山东",
"41":"河南",
"42":"湖北",
"43":"湖南",
"44":"广东",
"46":"海南",
"50":"重庆",
"51":"四川",
"52":"贵州",
"53":"云南",
"54":"西藏",
"61":"陕西",
"62":"甘肃",
"63":"青海",
"64":"宁夏",
"65":"新疆",
"71":"台湾",
"81":"香港",
"82":"澳门"}

XIAN_DICT = {
"上海市": {
 "上海市": [
  "黄浦区",
  "徐汇区",
  "静安区",
  "长宁区",
  "普陀区",
  "闸北区",
  "虹口区",
  "杨浦区",
  "浦东新区",
  "闵行区",
  "奉贤区",
  "松江区",
  "青浦区",
  "嘉定区",
  "宝山区",
  "金山区",
  "崇明县"
  ]
 },
"云南省": {
 "昆明": [
  "呈贡区",
  "盘龙区",
  "西山区",
  "五华区",
  "东川区",
  "官渡区",
  "安宁市",
  "富民县",
  "晋宁县",
  "崇明县",
  "宜良县",
  "石林彝族自治县",
  "禄劝彝族苗族自治县",
  "寻甸回族彝族自治县"
  ],
 "临沧": [
  "临翔区",
  "永德县",
  "镇康县",
  "云县",
  "凤庆县",
  "双江拉祜族佤族布朗族自治县",
  "耿马傣族佤族自治县",
  "沧源佤族自治县"
  ],
 "丽江": [
  "古城区",
  "永胜县",
  "华坪县",
  "宁蒗彝族自治县",
  "玉龙纳西族自治县"
  ],
 "保山": [
  "隆阳区",
  "腾冲市",
  "昌宁县",
  "施甸县",
  "龙陵县"
  ],
 "大理白族自治州": [
  "大理市",
  "洱源县",
  "剑川县",
  "鹤庆县",
  "宾川县",
  "祥云县",
  "永平县",
  "云龙县",
  "弥渡县",
  "南涧彝族自治县",
  "巍山彝族回族自治县",
  "漾濞彝族自治县"
  ],
 "德宏傣族景颇族自治州": [
  "芒市",
  "瑞丽市",
  "陇川县",
  "梁河县",
  "盈江县"
  ],
 "怒江傈僳族自治州": [
  "泸水市",
  "福贡县",
  "兰坪白族普米族自治县",
  "贡山独龙族自治县"
  ],
 "文山壮族苗族自治州": [
  "文山市",
  "砚山县",
  "丘北县",
  "广南县",
  "富宁县",
  "西畴县",
  "麻栗坡县",
  "西关县"
  ],
 "昭通": [
  "昭阳区",
  "巧家县",
  "鲁甸县",
  "镇雄县",
  "永善县",
  "大关县",
  "盐县津",
  "彝良县",
  "绥江县",
  "水富县",
  "威信县"
  ],
 "普洱": [
  "思茅区",
  "墨江哈尼族自治县",
  "澜沧拉祜族自治县",
  "镇沅彝族哈尼族拉祜族自治县",
  "宁洱哈尼族彝族自治县",
  "西盟佤族自治县",
  "孟连傣族拉祜族佤族自治县",
  "江城哈尼族彝族自治县",
  "景谷傣族彝族自治县",
  "景东彝族自治县"
  ],
 "曲靖": [
  "麒麟区",
  "沾益区",
  "宣威市",
  "会泽县",
  "马龙县",
  "富源县",
  "陆良县",
  "师宗县",
  "罗平县"
  ],
 "楚雄彝族自治州": [
  "楚雄市",
  "禄丰县",
  "元谋县",
  "永仁县",
  "武定县",
  "双柏县",
  "南华县",
  "姚安县",
  "大姚县",
  "牟定县"
  ],
 "玉溪": [
  "红塔区",
  "江川区",
  "易门县",
  "澄江县",
  "通海县",
  "华宁县",
  "峨山县",
  "元江县",
  "新平县"
  ],
 "红河哈尼族彝族自治州": [
  "蒙自市",
  "个旧市",
  "弥勒市",
  "开远市",
  "泸西县",
  "建水县",
  "红河县",
  "石屏县",
  "元阳县",
  "绿春县",
  "屏边苗族自治县",
  "河口瑶族自治县",
  "金平苗族瑶族傣族自治县"
  ],
 "西双版纳纳傣自治州": [
  "景洪市",
  "勐腊县",
  "勐海县"
  ],
 "迪庆藏族自治州": [
  "香格里拉市",
  "德钦县",
  "维西傈僳族自治县"
  ]
 },
"内蒙古自治区：": {
 "乌兰察布": [
  "集宁区",
  "丰镇市",
  "卓资县",
  "化德县",
  "商都县",
  "兴和县",
  "凉城县",
  "四子王旗",
  "察哈尔右翼前旗",
  "察哈尔右翼中旗",
  "察哈尔右翼后旗"
  ],
 "乌海": [
  "海勃湾",
  "海南区",
  "乌达区"
  ],
 "兴安盟": [
  "乌兰浩特市",
  "阿尔山市",
  "突泉县",
  "扎赉特旗",
  "科尔沁右翼前旗",
  "科尔沁右翼中旗"
  ],
 "包头": [
  "昆都仑区",
  "青山区",
  "东河区",
  "九原区",
  "石拐区",
  "白云鄂博市",
  "固阳县",
  "土默特右旗"
  ],
 "呼伦贝尔": [
  "海拉尔区",
  "扎赉诺尔区",
  "满洲里市",
  "牙克石市",
  "额尔古纳市",
  "根河市",
  "扎兰屯市",
  "鄂温克族旗",
  "新巴尔虎左旗",
  "新巴尔虎右旗",
  "陈巴尔虎旗",
  "阿荣旗 莫力达瓦旗",
  "鄂伦春旗"
  ],
 "呼和浩特": [
  "新城区",
  "玉泉区",
  "回民区",
  "赛罕",
  "托克托县",
  "林格尔县",
  "清水河县",
  "武川县",
  "土默特左旗"
  ],
 "巴彦淖尔": [
  "临河区",
  "五原县",
  "磴口县",
  "乌拉特前旗",
  "乌拉特中旗",
  "乌拉特后旗",
  "杭锦后旗"
  ],
 "赤峰": [
  "红山区",
  "松山区",
  "元宝区",
  "宁城县",
  "林西县",
  "敖汉旗",
  "喀喇沁旗",
  "翁牛特旗",
  "巴林左旗",
  "巴林右旗",
  "克什克腾旗",
  "阿鲁科尔沁旗"
  ],
 "通辽": [
  "科尔沁区",
  "霍林郭勒市",
  "开鲁县",
  "科左中旗",
  "科左后旗",
  "库伦旗",
  "扎鲁特旗",
  "奈曼旗"
  ],
 "鄂尔多斯": [
  "东胜区",
  "康巴什区",
  "准格尔旗",
  "达拉特旗",
  "鄂托克旗",
  "鄂托克前旗",
  "伊金霍洛旗",
  "乌审旗",
  "杭锦旗"
  ],
 "锡林郭勒盟": [
  "锡林浩特市",
  "二连浩特市",
  "多伦县",
  "正蓝旗",
  "正镶白旗",
  "太仆寺旗",
  "镶黄旗",
  "阿巴嘎旗",
  "东乌珠穆沁旗",
  "苏尼特左旗",
  "苏尼特右旗",
  "西乌珠穆沁旗"
  ],
 "阿拉善盟": [
  "阿拉善左旗",
  "阿拉善右旗",
  "额济纳旗"
  ]
 },
"北京市": {
 "北京市": [
  "东城区",
  "西城区",
  "朝阳区",
  "石景山区",
  "丰台区",
  "海淀区",
  "通州区",
  "平谷区",
  "顺义区",
  "怀柔区",
  "密云区",
  "延庆区",
  "昌平区",
  "门头沟区",
  "房山区",
  "大兴区"
  ]
 },
"吉林省": {
 "吉林": [
  "船营区",
  "龙潭区",
  "丰满区",
  "昌邑区",
  "磐石市",
  "桦甸市",
  "蛟河市",
  "舒兰市",
  "永吉县"
  ],
 "四平": [
  "铁西区",
  "铁东区",
  "双辽市",
  "公主岭市",
  "梨树县",
  "伊通满族自治县"
  ],
 "延边朝鲜族自治州": [
  "延吉市",
  "图们市",
  "龙井市",
  "和龙市",
  "敦化市",
  "珲春市",
  "安图县",
  "汪清县"
  ],
 "松原": [
  "宁江区",
  "扶余市",
  "乾安县",
  "长岭县",
  "前郭尔罗斯蒙古族自治县"
  ],
 "白城": [
  "洮北区",
  "洮南市",
  "大安市",
  "通榆县",
  "镇赉县"
  ],
 "白山": [
  "浑江区",
  "江源区",
  "临江市",
  "抚松县",
  "靖宇县",
  "长白朝鲜族自治县"
  ],
 "辽源": [
  "龙山区",
  "西安区",
  "东丰县",
  "东辽县"
  ],
 "通化": [
  "东昌区",
  "二道江区",
  "集安市",
  "梅河口市",
  "辉南县",
  "柳河县",
  "通化县"
  ],
 "长春": [
  "南关区",
  "宽城区",
  "朝阳区",
  "二道区",
  "双阳区",
  "九台区",
  "绿园区",
  "德惠市",
  "榆树市",
  "农安县"
  ]
 },
"四川省": {
 "乐山": [
  "市中区",
  "五通桥区",
  "沙湾区",
  "金河口区",
  "峨眉山市",
  "井研县",
  "夹江县",
  "犍为县",
  "沐川县",
  "峨边自治县",
  "马边自治县"
  ],
 "内江": [
  "市中区",
  "东兴区",
  "资中县",
  "隆昌县",
  "威远县"
  ],
 "凉山自治州": [
  "西昌市",
  "会理县",
  "会东县",
  "普格县",
  "宁南县",
  "德昌县",
  "冕宁县",
  "盐源县",
  "昭觉县",
  "金阳县",
  "美姑县",
  "布拖县",
  "越西县",
  "喜德县",
  "甘洛县",
  "木里藏族自治县"
  ],
 "南充": [
  "顺庆区",
  "高坪区",
  "嘉陵区",
  "阆中市",
  "西充县",
  "南部县",
  "仪陇县",
  "营山县",
  "蓬安县"
  ],
 "宜宾": [
  "翠屏区",
  "南溪区",
  "江安县",
  "长宁县",
  "兴文县",
  "珙县",
  "宜宾县",
  "高县",
  "筠连县",
  "屏山县"
  ],
 "巴中": [
  "巴州区",
  "恩阳区",
  "南江县",
  "平昌县",
  "通江县"
  ],
 "广元": [
  "市中区",
  "朝天区",
  "昭化区",
  "青川县",
  "旺苍县",
  "剑阁县",
  "苍溪县"
  ],
 "广安": [
  "广安区",
  "前锋区",
  "华蓥市",
  "岳池县",
  "武胜县",
  "邻水县"
  ],
 "德阳": [
  "旌阳区",
  "什邡市",
  "广汉市",
  "绵竹市",
  "中江县",
  "罗江县"
  ],
 "成都": [
  "武侯区",
  "锦江区",
  "青羊区",
  "金牛区",
  "成华区",
  "龙泉驿区",
  "温江区",
  "新都区",
  "青白江区",
  "双流区",
  "都江堰市",
  "彭州市",
  "简阳市",
  "邛崃市",
  "崇州市",
  "金堂县",
  "大邑县",
  "新津县",
  "蒲江县",
  "郫县"
  ],
 "攀枝花": [
  "东区",
  "西区",
  "仁和区",
  "盐边县",
  "米易县"
  ],
 "泸州": [
  "江阳区",
  "龙马潭区",
  "纳溪区",
  "泸县",
  "合江县",
  "叙永县",
  "古蔺县"
  ],
 "甘孜自治州": [
  "康定市",
  "理塘县",
  "泸定县",
  "九龙县",
  "丹巴县",
  "道孚县",
  "色达县",
  "甘孜县",
  "新龙县",
  "白玉县",
  "德格县",
  "石渠县",
  "雅江县",
  "巴塘县",
  "稻城县",
  "乡城县",
  "得荣县",
  "炉霍县"
  ],
 "眉山": [
  "东坡区",
  "彭山区",
  "丹棱县",
  "洪雅县",
  "青神县",
  "仁寿县"
  ],
 "绵阳": [
  "涪城区",
  "安州区",
  "游仙区",
  "江油市",
  "梓潼县",
  "平武县",
  "盐亭县",
  "三台县",
  "北川自治县"
  ],
 "自贡": [
  "自流井区",
  "贡井区",
  "大安区",
  "沿滩区",
  "荣县",
  "富顺县"
  ],
 "资阳": [
  "雁江区",
  "安岳县",
  "乐至县"
  ],
 "达州": [
  "通川区",
  "达川区",
  "万源市",
  "大竹县",
  "渠县",
  "宣汉县",
  "开江县"
  ],
 "遂宁": [
  "船山区",
  "安居区",
  "蓬溪县",
  "射洪县",
  "大英县"
  ],
 "阿坝自治州": [
  "马尔康市",
  "汶川县",
  "理县",
  "茂县",
  "松潘县",
  "九寨沟县",
  "黑水县",
  "金川县",
  "小金县",
  "红原县",
  "若尔盖县",
  "阿坝县",
  "壤塘县"
  ],
 "雅安": [
  "雨城区",
  "名山区",
  "荥经县",
  "汉源县",
  "石棉县",
  "天全县",
  "芦山县",
  "宝兴县"
  ]
 },
"天津市": {
 "天津市": [
  "河东区",
  "河西区",
  "东丽区",
  "和平区",
  "津南区",
  "西青区",
  "南开区",
  "红桥区",
  "河北区",
  "宁河区",
  "静海区",
  "武清区",
  "宝坻区",
  "北辰区",
  "滨海新区",
  "蓟县"
  ]
 },
"宁夏回族自治区": {
 "中卫": [
  "沙坡头区",
  "中宁县",
  "海原县"
  ],
 "吴忠": [
  "利通区",
  "红寺堡区",
  "青铜峡市",
  "同心县",
  "盐池县"
  ],
 "固原": [
  "原州区",
  "西吉县",
  "隆德县",
  "泾源县",
  "彭阳县"
  ],
 "石嘴山": [
  "大武口区",
  "惠农区",
  "平罗县"
  ],
 "银川": [
  "兴庆区",
  "西夏区",
  "金凤区",
  "灵武市",
  "永宁县",
  "贺兰县"
  ]
 },
"安徽省": {
 "六安": [
  "金安区",
  "裕安区",
  "叶集区",
  "舒城县",
  "寿县",
  "霍山县",
  "金寨县",
  "霍邱县"
  ],
 "合肥": [
  "庐阳区",
  "瑶海区",
  "包河区",
  "蜀山区",
  "巢湖市",
  "长丰县",
  "肥西县",
  "肥东县",
  "庐江县"
  ],
 "安庆": [
  "迎江区",
  "宜秀区",
  "大观区",
  "桐城市",
  "怀宁县",
  "望江县",
  "潜山县",
  "太湖县",
  "宿松县",
  "岳西县"
  ],
 "宣城": [
  "宣州区",
  "宁国市",
  "郎溪县",
  "绩溪县",
  "广德县",
  "泾县",
  "旌德县"
  ],
 "宿州": [
  "埇桥区",
  "灵璧县",
  "泗县",
  "萧县",
  "砀山县"
  ],
 "毫州": [
  "谯城区",
  "蒙城县",
  "涡阳县",
  "利辛县"
  ],
 "池州": [
  "贵池区",
  "青阳县",
  "石台县",
  "东至县"
  ],
 "淮北": [
  "相山区",
  "烈山区",
  "杜集区",
  "濉溪县"
  ],
 "淮南": [
  "大通区",
  "田家庵区",
  "谢家集区",
  "八公山区",
  "潘集区",
  "凤台县",
  "寿县"
  ],
 "滁州": [
  "琅琊区",
  "凤阳县",
  "定远县",
  "南谯区",
  "来安县",
  "天长县",
  "明光市",
  "全椒县"
  ],
 "芜湖": [
  "镜湖区",
  "弋江区",
  "三山区",
  "鸠江区",
  "芜湖县",
  "繁昌县",
  "南陵县",
  "无为县"
  ],
 "蚌埠": [
  "龙子湖区",
  "蚌山区",
  "禹会区",
  "淮上区",
  "五河县",
  "怀远县",
  "固镇县"
  ],
 "铜陵": [
  "铜官区",
  "义安区",
  "郊区",
  "枞阳县"
  ],
 "阜阳": [
  "颖州区",
  "颖东区",
  "颖泉区",
  "界首市",
  "颍上县",
  "阜南县",
  "临泉县",
  "太和县"
  ],
 "马鞍山": [
  "花山区",
  "雨山区",
  "博望区",
  "含山县",
  "和县",
  "当涂县"
  ],
 "黄山": [
  "黄山区",
  "屯溪区",
  "徽州区",
  "休宁县",
  "黟县",
  "歙县",
  "祁门县"
  ]
 },
"山东省": {
 "东营": [
  "东营区",
  "河口区",
  "垦利区",
  "广饶县",
  "利津县"
  ],
 "临沂": [
  "兰山区",
  "罗庄区",
  "河东区",
  "平邑县",
  "费县",
  "郯城县",
  "蒙阴县",
  "沂南县",
  "沂水县",
  "莒南县",
  "临沭县",
  "苍山县"
  ],
 "威海": [
  "环翠区",
  "文登区",
  "荣成市",
  "乳山市"
  ],
 "德州": [
  "德城区",
  "禹城区",
  "乐陵市",
  "禹城市",
  "齐河县",
  "临邑县",
  "平原县",
  "夏津县",
  "武城县",
  "宁津县",
  "庆云县"
  ],
 "日照": [
  "东港区",
  "岚山区",
  "五莲县",
  "莒县"
  ],
 "枣庄": [
  "市中区",
  "山亭区",
  "台儿庄区",
  "峄城区",
  "薛城区",
  "滕州市"
  ],
 "泰安": [
  "泰山区",
  "岱岳区",
  "新泰市",
  "肥城市",
  "宁阳县",
  "东平县"
  ],
 "济南": [
  "市中区",
  "历下区",
  "历城区",
  "槐荫区",
  "天桥区",
  "长清区",
  "章丘市",
  "平阴县",
  "济阳县",
  "商河县"
  ],
 "济宁": [
  "任城区",
  "兖州区",
  "曲阜市",
  "邹城市",
  "金乡县",
  "鱼台县",
  "嘉祥县",
  "汶上县",
  "梁山",
  "泗水县",
  "微山县"
  ],
 "淄博": [
  "淄川区",
  "博山区",
  "周村区",
  "临淄区",
  "张店区",
  "沂源市",
  "高青市",
  "博兴市"
  ],
 "滨州": [
  "滨城区",
  "沾化区",
  "惠民县",
  "阳信县",
  "无棣县",
  "邹平县",
  "博兴县"
  ],
 "潍坊": [
  "潍城区",
  "寒亭区",
  "坊子区",
  "奎文区",
  "昌邑市",
  "高密市",
  "安丘市",
  "诸城市",
  "青州市",
  "寿光市",
  "临朐县",
  "昌乐县"
  ],
 "烟台": [
  "芝罘区",
  "牟平区",
  "福山区",
  "莱山区",
  "莱州市",
  "海阳市",
  "莱阳市",
  "栖霞市",
  "招远市",
  "蓬莱市",
  "龙口市",
  "长岛县"
  ],
 "聊城": [
  "东昌府区",
  "临清市",
  "东阿县",
  "茌平县",
  "阳谷县",
  "莘县",
  "冠县",
  "高唐县"
  ],
 "莱芜": [
  "莱城区",
  "钢城区"
  ],
 "菏泽": [
  "牡丹区",
  "定陶区",
  "单县",
  "成武县",
  "曹县",
  "东明县",
  "郓城县",
  "巨野县",
  "鄄城县"
  ],
 "青岛": [
  "市南区",
  "市北区",
  "李沧区",
  "崂山区",
  "城阳区",
  "黄岛区",
  "即墨市",
  "胶州市",
  "莱西市",
  "平度市"
  ]
 },
"山西省": {
 "临汾": [
  "尧都区",
  "侯马市",
  "霍州市",
  "曲沃县",
  "汾西县 洪洞县",
  "蒲县",
  "隰县",
  "永和县",
  "襄汾县",
  "乡宁县",
  "吉县",
  "大宁县",
  "古县",
  "安泽县",
  "浮山县",
  "翼城县"
  ],
 "吕梁": [
  "离石区",
  "汾阳市",
  "孝义市",
  "交城县",
  "文水县",
  "交口县",
  "石楼县",
  "方山县",
  "临县",
  "柳林县",
  "中阳县",
  "岚县",
  "兴县"
  ],
 "大同": [
  "城区",
  "矿区",
  "南郊区",
  "��荣区",
  "灵丘县",
  "左云县",
  "大同县",
  "浑源县",
  "广灵县",
  "阳高县",
  "天镇县"
  ],
 "太原": [
  "杏花岭区",
  "小店区",
  "迎泽区",
  "晋源区",
  "尖草坪区",
  "万柏林区",
  "古交市",
  "阳曲县",
  "娄烦县",
  "清徐县"
  ],
 "晋中": [
  "榆次区",
  "介休市",
  "太古县",
  "祁县",
  "平遥县",
  "灵石县",
  "寿阳县",
  "榆社县",
  "左权县",
  "和顺县",
  "昔阳县"
  ],
 "晋城": [
  "城区",
  "高平市",
  "阳城县",
  "沁水县",
  "陵川县",
  "泽州县"
  ],
 "朔州": [
  "朔城区",
  "平鲁区",
  "山阴县",
  "右玉县",
  "应县",
  "怀仁县"
  ],
 "沂州": [
  "忻府区",
  "原平市",
  "代县",
  "繁峙县",
  "静乐县",
  "定囊县",
  "五台县",
  "神池县",
  "五寨县",
  "岢岚县",
  "偏关县",
  "河曲县",
  "保德县",
  "宁武县"
  ],
 "运城": [
  "盐湖区",
  "永济市",
  "河津市",
  "新绛县",
  "稷山县",
  "绛县",
  "垣曲县",
  "闻喜县",
  "临猗县",
  "万荣县",
  "平陆县",
  "夏县",
  "芮城县"
  ],
 "长治": [
  "城区",
  "郊区",
  "潞城区",
  "长治县",
  "襄垣县",
  "屯留县",
  "平顺县",
  "黎城县",
  "壶关县",
  "长子县",
  "武乡县",
  "沁县",
  "沁源县"
  ],
 "阳泉": [
  "城区",
  "郊区",
  "矿区",
  "孟县",
  "平定县"
  ]
 },
"广东省": {
 "东莞": [
  ],
 "中山": [
  ],
 "云浮": [
  "云城区",
  "云安区",
  "罗定市",
  "郁南县",
  "新兴县"
  ],
 "佛山": [
  "三水区",
  "南海区",
  "德顺区",
  "高明区",
  "禅城区"
  ],
 "广州": [
  "荔湾区",
  "海珠区",
  "芳村区",
  "越秀区",
  "天河区",
  "黄埔区",
  "花都区",
  "从化区",
  "白云区",
  "增城区",
  "番禹区"
  ],
 "惠州": [
  "惠城区",
  "惠阳区",
  "博罗县",
  "惠东县",
  "龙门县"
  ],
 "揭阳": [
  "榕城区",
  "揭东区",
  "普宁市",
  "惠来县",
  "揭西县"
  ],
 "梅州": [
  "梅江区",
  "梅县区",
  "兴宁市",
  "蕉岭县",
  "大埔县",
  "丰顺县",
  "五华县",
  "平远县"
  ],
 "汕头": [
  "潮阳区",
  "澄海区",
  "金区平",
  "龙湖区",
  "濠江区",
  "潮南区",
  "南澳县"
  ],
 "汕尾": [
  "城区",
  "海丰县",
  "陆丰县",
  "陆河县"
  ],
 "江门": [
  "江海区",
  "蓬江区",
  "新会区",
  "台山市",
  "开平市",
  "恩平市",
  "鹤山市"
  ],
 "河源": [
  "源城区",
  "连平县",
  "和平县",
  "龙川县",
  "紫金县",
  "东源县"
  ],
 "深圳": [
  "宝安区",
  "罗湖区",
  "福田区",
  "南山区",
  "盐田区",
  "龙岗区",
  "光明新区",
  "龙华新区",
  "坪山新区",
  "大鹏新区"
  ],
 "清远": [
  "清城区",
  "清新区",
  "英德市",
  "连州市",
  "阳山县",
  "佛冈县",
  "连山自治县",
  "连南自治县"
  ],
 "湛江": [
  "霞山区",
  "麻章区",
  "赤坎区",
  "坡头区",
  "雷州市",
  "廉江市",
  "吴川市",
  "遂溪县",
  "徐闻县"
  ],
 "潮州": [
  "潮安区",
  "湘桥区",
  "饶平县"
  ],
 "珠海": [
  "斗门区",
  "香洲区",
  "金湾区"
  ],
 "肇庆": [
  "端州区",
  "鼎湖区",
  "高要区",
  "四会市",
  "广宁县",
  "怀集县",
  "封开县",
  "德庆县"
  ],
 "茂名": [
  "电白区",
  "茂南区",
  "化州市",
  "高州市",
  "信宜市"
  ],
 "阳江": [
  "江城区",
  "阳东区",
  "阳春市",
  "阳西县"
  ],
 "韶关": [
  "浈江区",
  "武江区",
  "曲江区",
  "乐昌市",
  "南雄市",
  "新丰县",
  "仁化县",
  "始兴县",
  "翁源县",
  "乳源自治县"
  ]
 },
"广西自治区": {
 "南宁": [
  "青秀区",
  "兴宁区",
  "西乡塘区",
  "江南区",
  "武鸣区",
  "良庆区",
  "邕宁区",
  "横县",
  "宾阳县",
  "上林县",
  "马山县",
  "隆安县"
  ],
 "北海": [
  "海城区",
  "银海区",
  "铁山港区",
  "合浦县"
  ],
 "崇左": [
  "江州区",
  "凭祥市",
  "扶绥县",
  "大新县",
  "龙州县",
  "宁明县",
  "天等县"
  ],
 "来宾": [
  "金秀 象州 武宣 兴宾区 忻城 合山"
  ],
 "柳州": [
  "柳北区",
  "柳南区",
  "城中区",
  "鱼峰区",
  "柳江县",
  "柳城县",
  "融安县",
  "鹿寨县",
  "三江自治县",
  "融水苗族自治县"
  ],
 "桂林": [
  "秀峰区",
  "叠彩区",
  "象山区",
  "七星区",
  "雁山区",
  "临桂区",
  "灵川县",
  "兴安县",
  "资源县",
  "全州县",
  "灌阳县",
  "永福县",
  "阳朔县",
  "平乐县",
  "荔浦县",
  "恭城瑶族自治县",
  "龙胜各族自治县"
  ],
 "梧州": [
  "长洲区",
  "万秀区",
  "龙圩区",
  "岑溪市",
  "苍梧县",
  "藤县",
  "蒙山县"
  ],
 "河池": [
  "金城江区",
  "宜州市",
  "南丹县",
  "天峨县",
  "东兰县",
  "凤山县",
  "巴马瑶族自治县",
  "凤山县都安瑶族自治县",
  "大化瑶族自治县",
  "罗城仫佬族自治县",
  "环江毛南族自治县"
  ],
 "玉林": [
  "玉州区",
  "福绵区",
  "北流市",
  "容县",
  "博白县",
  "陆川县",
  "兴业县"
  ],
 "百色": [
  "右江区",
  "靖西市",
  "平果县",
  "田东县",
  "凌云县",
  "乐业县",
  "田林县",
  "那坡县",
  "西林县",
  "田阳县",
  "德保县",
  "隆林各族自治县"
  ],
 "贵港": [
  "港北区",
  "港南区",
  "覃塘区",
  "桂平市",
  "平南县"
  ],
 "贺州": [
  "八步区",
  "钟山县",
  "昭平县",
  "富川瑶族自治县"
  ],
 "钦州": [
  "钦南区",
  "钦北区",
  "浦东县",
  "灵山县"
  ],
 "防城港": [
  "港口区",
  "防城区",
  "东兴市",
  "上思县"
  ]
 },
"新疆维吾尔族自治区": {
 "乌鲁木齐": [
  "天山区",
  "新市区",
  "达坂城区",
  "沙依巴克区",
  "头屯区",
  "水磨沟区",
  "米东区",
  "乌鲁木齐县"
  ],
 "伊犁哈萨克自治州": [
  "伊宁市",
  "奎屯市",
  "伊宁县",
  "霍城县",
  "巩留县",
  "特克斯县",
  "昭苏县",
  "尼勒克县",
  "新源县",
  "察布查尔锡伯自治县"
  ],
 "克孜勒苏柯尔克孜自治州": [
  "阿图什市",
  "阿合奇县",
  "乌恰县",
  "阿克陶县"
  ],
 "克拉玛依市": [
  "独山子区",
  "克拉玛依区",
  "白碱滩区",
  "乌尔禾区"
  ],
 "博尔塔拉蒙古族自治州": [
  "博乐市",
  "精河县",
  "温泉县",
  "阿拉山口市"
  ],
 "吐鲁番": [
  "高昌区",
  "托克逊县",
  "鄯善县"
  ],
 "和田地区": [
  "和田市",
  "和田县",
  "皮山县",
  "和田县",
  "墨玉县",
  "洛浦县",
  "策勒县",
  "于田县",
  "民丰县"
  ],
 "哈密市": [
  "哈密市",
  "巴里坤哈尼克自治县",
  "伊吾县"
  ],
 "喀什地区": [
  "喀什市",
  "巴楚县",
  "疏阜县",
  "疏勒县",
  "伽师县",
  "岳普湖县",
  "英吉沙县",
  "麦盖提县",
  "莎车县",
  "泽普县",
  "叶城县",
  "塔什库尔干塔吉克自治县"
  ],
 "塔城地区": [
  "塔城市",
  "乌苏市",
  "沙湾县",
  "托里县",
  "额敏县",
  "裕民县",
  "和布克赛尔蒙古族自治县"
  ],
 "巴音郭楞蒙古自治州": [
  "库尔勒市",
  "和硕县",
  "和静县",
  "博湖县",
  "尉犁县",
  "轮台县",
  "若羌县",
  "且末县",
  "焉耆回族自治县"
  ],
 "昌吉回族自治州": [
  "昌吉市",
  "阜康市",
  "呼图壁县",
  "米泉县",
  "吉木萨尔县",
  "吉台县",
  "玛纳斯县",
  "米垒哈萨克自治县"
  ],
 "直辖县级市": [
  "石河子市",
  "阿拉尔市",
  "图木舒克市",
  "北屯市",
  "铁门山市",
  "���河市",
  "五家渠市",
  "可克达拉市",
  "昆玉市"
  ],
 "阿克苏地区": [
  "阿克苏市",
  "库车县",
  "新和县",
  "沙雅县",
  "拜城县",
  "温宿县",
  "阿瓦提县",
  "乌什县",
  "柯坪县"
  ],
 "阿勒泰地区": [
  "阿勒泰市",
  "富蕴县",
  "青河县",
  "福海县",
  "布尔津县",
  "哈巴河",
  "吉木乃县"
  ]
 },
"江苏省": {
 "南京": [
  "玄武区",
  "秦淮区",
  "鼓楼区",
  "建邺区",
  "雨花台区",
  "栖霞区",
  "浦口区",
  "江宁区",
  "溧水区",
  "高涥区",
  "六合区"
  ],
 "南通": [
  "崇川区",
  "港闸区",
  "通州区",
  "海门市",
  "如皋市",
  "启东市",
  "如东县",
  "海安县"
  ],
 "宿迁": [
  "宿城区",
  "宿豫区",
  "湖滨新区",
  "洋河新区",
  "沭阳县",
  "泗洪县"
  ],
 "常州": [
  "武进区",
  "天宁区",
  "钟楼区",
  "新北区",
  "金坛区",
  "潥阳市"
  ],
 "徐州": [
  "云龙区",
  "鼓楼区",
  "贾汪区",
  "泉山区",
  "铜山区",
  "新沂市",
  "邳州市",
  "睢宁县",
  "丰县",
  "沛县"
  ],
 "扬州": [
  "邗江区",
  "广陵区",
  "江都区",
  "仪征市",
  "高邮市",
  "宝应县"
  ],
 "无锡": [
  "滨湖区",
  "梁溪区",
  "锡山区",
  "惠山区",
  "新吴区",
  "宜兴市",
  "江阴市"
  ],
 "泰州": [
  "海陵区",
  "高港区",
  "姜堰区",
  "靖江市",
  "泰兴市",
  "兴化市"
  ],
 "淮安": [
  "清河区",
  "青浦区",
  "淮阴区",
  "淮安区",
  "金湖县",
  "盱眙县",
  "洪泽县",
  "涟水县"
  ],
 "盐城": [
  "亭湖区",
  "盐都区",
  "大丰区",
  "东台市",
  "射阳县",
  "阜宁县",
  "滨海县",
  "响水县",
  "建湖县"
  ],
 "苏州": [
  "姑苏区",
  "吴中区",
  "相城区",
  "吴江区",
  "虎丘区",
  "昆山市",
  "太仓市",
  "常熟市",
  "张家港市"
  ],
 "连云港": [
  "海州区",
  "连云区",
  "赣榆区",
  "灌云县",
  "东海县",
  "灌南县"
  ],
 "镇江": [
  "京口区",
  "润州区",
  "丹徒区",
  "扬中市",
  "丹阳市",
  "句容市"
  ]
 },
"江西省": {
 "上饶": [
  "信州区",
  "广丰区",
  "德兴市",
  "鄱阳县",
  "婺源县",
  "上饶县",
  "横峰县",
  "弋阳县",
  "铅山县",
  "玉山县",
  "余干县",
  "万年县"
  ],
 "九江": [
  "浔阳区",
  "濂溪区",
  "庐山市",
  "瑞昌市",
  "共青城市",
  "永修县",
  "德安县",
  "九江县",
  "武宁县",
  "修水县",
  "湖口县",
  "都昌县",
  "彭泽县"
  ],
 "南昌": [
  "东湖区",
  "西湖区",
  "青山湖区",
  "青云谱区",
  "湾里区",
  "新建区",
  "南昌县",
  "安义县",
  "进贤县"
  ],
 "吉安": [
  "吉州区",
  "青原区",
  "井冈山市",
  "新干县",
  "峡江县",
  "永丰县",
  "吉水县",
  "吉安县",
  "安福县",
  "永新县",
  "泰和县",
  "万安县",
  "遂川县"
  ],
 "宜春": [
  "袁州区",
  "高安市",
  "丰城市",
  "樟树市",
  "靖安县",
  "奉新县",
  "万载县",
  "铜鼓县",
  "宜丰县",
  "上高县"
  ],
 "抚州": [
  "临川区",
  "南城县",
  "东乡县",
  "资溪县",
  "崇仁县",
  "乐安县",
  "宜黄县",
  "南丰县",
  "黎川县",
  "南城县",
  "金溪县",
  "广昌县"
  ],
 "新余": [
  "渝水区",
  "分宜县"
  ],
 "景德镇": [
  "珠山区",
  "昌江区",
  "乐平市",
  "浮梁县"
  ],
 "萍乡": [
  "安源区",
  "湘东区",
  "莲花县",
  "芦溪县",
  "上栗县"
  ],
 "赣州": [
  "章贡区",
  "南康区",
  "瑞金市",
  "信丰县",
  "赣县",
  "上犹县",
  "崇义县",
  "大余县",
  "龙南县",
  "全南县",
  "定南县",
  "安远县",
  "寻乌县",
  "于都县",
  "兴国县",
  "会昌县",
  "石城县",
  "宁都县"
  ],
 "鹰潭": [
  "月湖区",
  "余江县",
  "贵溪县"
  ]
 },
"河北省": {
 "保定": [
  "竞秀区",
  "莲池区",
  "清苑区",
  "满城区",
  "徐水区",
  "高碑店市",
  "定州市",
  "安国市",
  "涿州市",
  "博野县",
  "蠡县",
  "高阳县",
  "安新县",
  "容城县",
  "雄县",
  "顺平县",
  "唐县",
  "望都县",
  "曲阳县",
  "阜平县",
  "涞水县",
  "易县",
  "涞源县",
  "定兴县"
  ],
 "唐山": [
  "路北区",
  "路南区",
  "丰南区",
  "开平区",
  "古冶区",
  "曹妃甸区",
  "丰润区",
  "遵化市",
  "迁安市",
  "滦南县",
  "乐亭县",
  "滦县",
  "玉田县",
  "迁西县"
  ],
 "廊坊": [
  "安次区",
  "广阳区",
  "霸州市",
  "三河市",
  "香河县",
  "固安县",
  "永清县",
  "文安县",
  "大城县",
  "大厂回族自治县"
  ],
 "张家口": [
  "桥东区",
  "桥西区",
  "宣化区",
  "下花园区",
  "万全区",
  "崇礼区",
  "怀来县",
  "赤城县",
  "涿鹿县",
  "蔚县",
  "阳原县",
  "怀安县",
  "张北县",
  "沽源县",
  "康保县",
  "尚义县"
  ],
 "承德": [
  "双桥区",
  "双滦区",
  "鹰手营子区",
  "承德县",
  "兴隆县",
  "平泉县",
  "隆化县",
  "滦平县",
  "围场满族蒙古族自治县",
  "丰宁满族自治县",
  "宽城满族自治县"
  ],
 "沧州": [
  "新华区",
  "运河区",
  "任丘市",
  "黄骅市",
  "河间市",
  "泊头市",
  "海兴县",
  "盐山县",
  "南皮县",
  "东光县",
  "吴桥县",
  "献县",
  "肃宁县",
  "青县",
  "沧县",
  "孟村回族自治县"
  ],
 "石家庄": [
  "长安区",
  "新华区",
  "桥西区",
  "栾城区",
  "裕华区",
  "井陉矿区",
  "藁城区",
  "鹿泉区",
  "新乐市",
  "晋州市",
  "辛集市",
  "井陉县",
  "平山县",
  "灵寿县",
  "行唐县",
  "正定县",
  "元氏县",
  "赞皇县",
  "高邑县",
  "赵县",
  "无极县",
  "深泽县"
  ],
 "秦皇岛": [
  "海港区",
  "北戴河区",
  "山海关区",
  "抚宁区",
  "卢龙县",
  "青龙县",
  "昌黎县"
  ],
 "衡水": [
  "桃城区",
  "冀州市",
  "深州市",
  "故城县",
  "枣强县",
  "武强县",
  "武邑县",
  "景县",
  "安平县",
  "阜城县",
  "饶阳县"
  ],
 "邢台": [
  "桥东区",
  "桥西区",
  "南宫市",
  "沙河市",
  "新河县",
  "内丘县",
  "临城县",
  "南和县",
  "平乡县",
  "广宗县",
  "威县",
  "清河县",
  "临西县",
  "邢台县",
  "任县",
  "巨鹿县",
  "隆尧县",
  "柏乡县",
  "宁晋县"
  ],
 "邯郸": [
  "邯山区",
  "复兴区",
  "丛台区",
  "峰峰矿区",
  "武安市",
  "邯郸县",
  "磁县",
  "涉县",
  "临漳县",
  "成安县",
  "魏县",
  "大名县",
  "永县年",
  "曲周县",
  "鸡泽县",
  "邱县",
  "肥乡县",
  "广平县",
  "馆陶县"
  ]
 },
"河南省": {
 "三门峡": [
  "湖滨区",
  "陕州区",
  "义马市",
  "灵宝市",
  "卢氏县",
  "渑池县"
  ],
 "信阳": [
  "平桥区",
  "浉河区",
  "罗山县",
  "息县",
  "淮滨县",
  "潢川县",
  "商城县",
  "光山县",
  "新县",
  "固始县"
  ],
 "南阳": [
  "宛城区",
  "卧龙区",
  "邓州市",
  "方城县",
  "社旗县",
  "唐河县",
  "新野县",
  "镇平县",
  "内乡县",
  "淅川县",
  "西峡县",
  "南召县",
  "桐柏县"
  ],
 "周口": [
  "川汇区",
  "项城市",
  "扶沟县",
  "太康县",
  "商水县",
  "沈丘县",
  "西华县",
  "淮阳县",
  "郸城县",
  "鹿邑县"
  ],
 "商丘": [
  "睢阳区",
  "梁园区",
  "永城市",
  "虞城县",
  "夏邑县",
  "柘城县",
  "民权县",
  "宁陵县",
  "睢县"
  ],
 "安阳": [
  "北关区",
  "文峰区",
  "龙安区",
  "殷都区",
  "安阳县",
  "汤阴县",
  "内黄县",
  "滑县",
  "林州县"
  ],
 "平顶山": [
  "新华区",
  "卫东区",
  "湛河区",
  "石龙区",
  "舞钢市",
  "郏县",
  "叶县",
  "鲁山县",
  "宝丰县汝州市"
  ],
 "开封": [
  "龙亭区",
  "顺河回族区",
  "鼓楼区",
  "禹王台区",
  "祥符区",
  "杞县",
  "兰考县",
  "通许县",
  "尉氏县"
  ],
 "新乡": [
  "卫滨区",
  "凤泉区",
  "牧野区",
  "红旗区",
  "卫辉市",
  "辉县市",
  "延津县",
  "封丘县",
  "长垣县",
  "原阳县",
  "新乡县",
  "获嘉县"
  ],
 "洛阳": [
  "洛龙区",
  "西工区",
  "老城区",
  "瀍河回族区",
  "涧西区",
  "吉利区",
  "偃师市",
  "孟津县",
  "汝阳县",
  "伊川县",
  "嵩县",
  "栾川县",
  "宜阳县",
  "洛宁县",
  "新安县"
  ],
 "济源市": [
  "原属于焦作市代管",
  "现升格为省直辖县级市"
  ],
 "漯河": [
  "郾城区",
  "源汇区",
  "召陵区",
  "舞阳县",
  "临颍县"
  ],
 "濮阳": [
  "华龙区",
  "开发区",
  "濮阳县",
  "清丰县",
  "南乐县",
  "范县",
  "台前县"
  ],
 "焦作": [
  "解放区",
  "马村区",
  "中站区",
  "山阳区",
  "沁阳市",
  "孟州市",
  "修武县",
  "博爱县",
  "温县",
  "武陟县"
  ],
 "许昌": [
  "魏都区",
  "长葛市",
  "禹州市",
  "襄城县",
  "许昌县",
  "鄢陵县"
  ],
 "郑州": [
  "中原区",
  "二七区",
  "管城区",
  "金水区",
  "上街区",
  "惠济区",
  "荥阳市",
  "新郑市",
  "巩义市",
  "登封市",
  "新密市",
  "中牟县"
  ],
 "驻马店": [
  "驿城区",
  "遂平县",
  "确山县",
  "汝南县",
  "平舆县",
  "新蔡县",
  "正阳县",
  "泌阳县",
  "上蔡县",
  "西平县"
  ],
 "鹤壁": [
  "淇滨区",
  "山城区",
  "鹤山区",
  "浚县",
  "淇县"
  ]
 },
"浙江省": {
 "杭州": [
  "上城区",
  "下城区",
  "江干区",
  "拱墅区",
  "西湖区",
  "滨江区",
  "余杭区",
  "萧山区",
  "富阳区",
  "临安市",
  "建德市",
  "桐庐县",
  "淳安县"
  ],
 "丽水": [
  "莲都区",
  "龙泉市",
  "遂昌县",
  "缙云县",
  "松阳县",
  "云和县",
  "庆云县",
  "青田县",
  "景宁畲族自治县"
  ],
 "台州": [
  "椒江区",
  "黄岩区",
  "路桥区",
  "临海市",
  "温岭市",
  "三门县",
  "天台县",
  "仙居县",
  "玉环县",
  ""
  ],
 "嘉兴": [
  "南湖区",
  "秀洲区",
  "海宁市",
  "桐乡市",
  "平湖市",
  "桐乡市",
  "嘉善县",
  "海盐县"
  ],
 "宁波": [
  "海曙区",
  "江北区",
  "江东区",
  "北仑区",
  "鄞州区",
  "镇海区",
  "慈溪市",
  "余姚市",
  "奉化市",
  "宁海县",
  "象山县"
  ],
 "温州": [
  "鹿城区",
  "龙湾区",
  "瓯海区",
  "洞头区",
  "瑞安市",
  "乐清市",
  "永嘉县",
  "文成县",
  "平阳县",
  "泰顺县",
  "苍南县"
  ],
 "湖州": [
  "吴兴区",
  "南浔区",
  "德清县",
  "长兴县",
  "安吉县"
  ],
 "绍兴": [
  "越城区",
  "柯桥区",
  "上虞区",
  "诸暨市",
  "嵊州市",
  "新昌"
  ],
 "舟山": [
  "普陀区",
  "定海区",
  "嵊泗县",
  "岱山县"
  ],
 "衢州": [
  "柯城区",
  "衢江区",
  "江山市",
  "常山县",
  "开化县",
  "龙游县"
  ],
 "金华": [
  "婺城区",
  "金东区",
  "兰溪市",
  "义乌市",
  "东阳市",
  "浦江县",
  "武义县",
  "永康市"
  ]
 },
"海南省": {
 "三亚": [
  "吉阳区",
  "崖州区",
  "天涯区",
  "海棠区"
  ],
 "三沙": [
  "西沙群岛",
  "中沙群岛",
  "南沙群岛"
  ],
 "儋州": [
  "那大镇、和庆镇、南丰镇、大成镇、雅星镇、兰洋镇、光村镇、木棠镇、海头镇、峨蔓镇、王五镇、白马井镇、中和镇、排浦镇、东成镇、新州镇"
  ],
 "海口": [
  "秀英区",
  "龙华区",
  "琼山区",
  "美兰区"
  ],
 "省直辖县级县市": [
  "五指山市",
  "文昌市",
  "琼海市",
  "万宁市",
  "东方市",
  "定安县",
  "屯昌县",
  "澄迈县",
  "临高县",
  "白沙自治县",
  "昌江自治县",
  "乐东自治县",
  "陵水自治县",
  "保亭自治县",
  "琼中自治县"
  ]
 },
"湖北省": {
 "武汉": [
  "江岸区",
  "江汉区",
  "硚口区",
  "汉阳区",
  "武昌区",
  "洪山区",
  "青山区",
  "蔡甸区",
  "江夏区",
  "东西湖区",
  "汉南区",
  "新洲区",
  "黄陂区"
  ],
 "仙桃": [
  ],
 "十堰": [
  "张湾区",
  "茅箭区",
  "郧阳区",
  "经济开发区",
  "丹江口市",
  "房县",
  "竹山县",
  "竹溪县",
  "郧西县"
  ],
 "咸宁": [
  "咸安区",
  "赤壁市",
  "嘉鱼县",
  "通城县",
  "崇阳县",
  "通山县"
  ],
 "天门": [
  ],
 "孝感": [
  "孝南区",
  "汉川市",
  "应城市",
  "安陆市",
  "大悟县",
  "云梦县",
  "孝昌县"
  ],
 "宜昌": [
  "夷陵区",
  "西陵区",
  "伍家岗区",
  "点军区",
  "猇亭区",
  "枝江市",
  "当阳市",
  "宜都市",
  "秭归县",
  "兴山县",
  "远安县",
  "五峰土家族自治县",
  "长阳土家族自治县"
  ],
 "恩施自治州": [
  "恩施市",
  "利川市",
  "巴东县",
  "建始县",
  "宣恩县",
  "咸丰县",
  "来凤县",
  "鹤峰县"
  ],
 "潜江": [
  ],
 "神农架": [
  ],
 "荆州": [
  "荆州区",
  "沙市区",
  "洪湖市",
  "松滋市",
  "石首市",
  "监利县",
  "江陵县",
  "公安县"
  ],
 "荆门市": [
  "漳河新区",
  "掇刀区",
  "东宝区",
  "钟祥县",
  "京山县",
  "沙洋县",
  "屈家岭管理区"
  ],
 "襄阳": [
  "襄城区",
  "樊城区",
  "襄州区",
  "枣阳市",
  "宜城市",
  "老河口市",
  "南漳县",
  "保康县",
  "谷城县"
  ],
 "鄂州": [
  "鄂城区",
  "华容区",
  "梁子湖区"
  ],
 "随州": [
  "曾都区",
  "广水市",
  "随县"
  ],
 "黄冈": [
  "黄州区",
  "麻城市",
  "武穴市",
  "蕲春县",
  "黄梅县",
  "浠水县",
  "红安县",
  "团风县",
  "罗田县",
  "英山县"
  ],
 "黄石": [
  "黄石岗区",
  "西塞山区",
  "下陆区",
  "铁山区",
  "大冶市",
  "阳新县"
  ]
 },
"湖南省": {
 "娄底": [
  "娄星区",
  "冷水江市",
  "涟源市",
  "新化县",
  "双峰县"
  ],
 "岳阳": [
  "岳阳楼区",
  "云溪区",
  "君山区",
  "汨罗市",
  "临湘市",
  "平江县",
  "湘阴县",
  "岳阳县",
  "华容县"
  ],
 "常德": [
  "武陵区",
  "鼎城区",
  "津市",
  "临澧县",
  "石门县",
  "澧县",
  "安乡县",
  "桃源县",
  "汉寿县"
  ],
 "张家界": [
  "永定区",
  "武陵源区",
  "桑植县",
  "慈利县"
  ],
 "怀化": [
  "鹤城区",
  "洪江市",
  "会同县",
  "靖州县",
  "通道县",
  "中方县",
  "芷江县",
  "新晃县",
  "淑浦县",
  "麻阳县",
  "辰溪县",
  "沅陵县"
  ],
 "株洲": [
  "天元区",
  "石峰区",
  "荷塘区",
  "芦淞区",
  "云龙示范区",
  "醴陵市",
  "株洲县",
  "茶陵县",
  "炎陵县",
  "攸县"
  ],
 "永州": [
  "零陵区",
  "冷水滩区",
  "祁阳县",
  "双牌县",
  "道县",
  "江永县",
  "江华县",
  "宁远县",
  "新田县",
  "蓝山县",
  "东安县"
  ],
 "湘潭": [
  "雨湖区",
  "岳塘区",
  "韶山市",
  "湘乡市",
  "湘潭县"
  ],
 "湘西土家族自治州": [
  "吉首市",
  "泸溪县",
  "凤凰县",
  "古丈县",
  "保靖县",
  "永顺县",
  "龙山县",
  "花垣县"
  ],
 "益阳": [
  "资阳区",
  "赫山区",
  "大通湖区",
  "沅江市",
  "桃江县",
  "安化县",
  "南县"
  ],
 "衡阳": [
  "雁峰区",
  "南岳区",
  "珠晖区",
  "石鼓区",
  "蒸湘区",
  "常宁市",
  "耒阳市",
  "衡南县",
  "衡阳县",
  "衡山县",
  "衡东县 祁东县"
  ],
 "邵阳": [
  "双清区",
  "北塔区",
  "大祥区",
  "武冈市",
  "邵阳县",
  "隆回县",
  "洞口县",
  "绥宁县",
  "邵东县",
  "新邵县",
  "城步自治县"
  ],
 "郴州": [
  "苏仙区",
  "北湖区",
  "资兴市",
  "永兴县",
  "桂东县",
  "安仁县",
  "汝城县",
  "宜章县",
  "临武县",
  "桂阳县",
  "嘉禾县"
  ],
 "长沙": [
  "芙蓉区",
  "天心区",
  "雨花区",
  "岳麓区",
  "望城区",
  "开福区",
  "浏阳市",
  "长沙县",
  "宁乡县"
  ]
 },
"甘肃省": {
 "临夏回族自治州": [
  "临夏市",
  "临夏县",
  "和政县",
  "广河县",
  "康乐县",
  "永靖县",
  "积石山保安族东乡族撒拉族县",
  "东乡族自治县"
  ],
 "兰州": [
  "城关区",
  "七里河区",
  "西固区",
  "安宁区",
  "红古区",
  "榆中县",
  "皋兰县",
  "永登县"
  ],
 "嘉峪关": [
  "峪泉镇",
  "文殊镇",
  "新城镇"
  ],
 "天水": [
  "秦城区",
  "麦积区",
  "清水县",
  "甘谷县 武山县",
  "秦安县",
  "张家川回族自治县"
  ],
 "定西": [
  "安定区",
  "临洮县",
  "通渭县",
  "陇西县",
  "魏源县",
  "漳县",
  "岷县"
  ],
 "平凉": [
  "崆峒区",
  "静宁县",
  "华亭县",
  "崇信县",
  "灵台县",
  "庄浪县",
  "泾川县"
  ],
 "庆阳": [
  "西峰区",
  "镇原县",
  "庆城县",
  "宁县",
  "正宁县",
  "合水县",
  "花池县",
  "环县"
  ],
 "张掖": [
  "甘州区",
  "山丹县",
  "临泽县",
  "高台县",
  "肃南县",
  "民乐县"
  ],
 "武威": [
  "凉州区",
  "古浪县",
  "民勤县",
  "天祝藏族自治县"
  ],
 "甘南藏族自治州": [
  "合作市",
  "夏河县",
  "碌曲县",
  "玛曲县",
  "迭部县",
  "临潭县",
  "卓尼县",
  "舟曲县"
  ],
 "白银": [
  "白银区",
  "平川区",
  "景泰县",
  "靖远县",
  "会宁县"
  ],
 "酒泉": [
  "肃州区",
  "玉门市",
  "敦煌市",
  "瓜州县",
  "金塔县",
  "肃北蒙古族自治县",
  "阿克塞哈萨克族自治县"
  ],
 "金昌": [
  "金川区",
  "永昌县"
  ],
 "陇南": [
  "武都区",
  "西和县",
  "礼县",
  "徽县",
  "两当县",
  "成县",
  "文县",
  "康县",
  "宕昌县"
  ]
 },
"福建省": {
 "福州": [
  "鼓楼区",
  "台江区",
  "仓山区",
  "晋安区",
  "马尾区",
  "长乐市",
  "福清市",
  "闽侯县",
  "平潭县",
  "连江县",
  "罗源县",
  "永泰县",
  "闽清县"
  ],
 "三明": [
  "梅列区",
  "三元区",
  "永安市",
  "将乐县",
  "泰宁县",
  "建宁县",
  "尤溪县",
  "明溪县",
  "清流县",
  "宁化县",
  "沙县",
  "大田县"
  ],
 "南平": [
  "延平区",
  "建阳区",
  "邵武市",
  "武夷山市",
  "建瓯市",
  "光泽县",
  "顺昌县",
  "浦城县",
  "松溪县",
  "政和县"
  ],
 "厦门": [
  "同安区",
  "思明区",
  "海沧区",
  "翔安区",
  "湖里区",
  "集美区"
  ],
 "宁德": [
  "蕉城区",
  "东桥新区",
  "福安市",
  "福鼎市",
  "古田县",
  "屏南县",
  "霞浦县",
  "柘荣县",
  "周宁县",
  "寿宁县"
  ],
 "泉州": [
  "鲤城区",
  "丰泽区",
  "泉港区",
  "洛江区",
  "晋江市",
  "石狮市",
  "南安市",
  "安溪县",
  "德化县",
  "永春县",
  "金门县",
  "惠安县"
  ],
 "漳州": [
  "芗城区",
  "龙文区",
  "龙海市",
  "漳浦县",
  "云霄县",
  "东山县",
  "诏安县",
  "南靖县",
  "平和县",
  "华安县",
  "长泰县"
  ],
 "莆田": [
  "荔城区",
  "秀屿区",
  "城厢区",
  "涵江区",
  "仙游县"
  ],
 "龙岩": [
  "永定区",
  "新罗区",
  "漳平市",
  "武平县",
  "连成县",
  "长汀县",
  "上杭县"
  ]
 },
"西藏自治区": {
 "山南": [
  "乃东区",
  "贡嘎县",
  "扎囊县",
  "浪卡子县",
  "洛扎县",
  "桑日县",
  "曲松县",
  "加查县",
  "隆子县",
  "错那县",
  "琼结县",
  "措美县"
  ],
 "拉萨": [
  "城关区",
  "堆龙德庆区",
  "达孜县",
  "墨竹工卡县",
  "曲水县",
  "当雄县",
  "林周县",
  "尼木县"
  ],
 "日喀则": [
  "桑珠孜区",
  "南木林县",
  "仁布县",
  "白朗县",
  "江攻县",
  "康马县",
  "亚东县",
  "岗巴县",
  "萨迦县",
  "定结县",
  "拉孜县",
  "定日县",
  "聂拉木县",
  "友谊桥县",
  "昂仁县",
  "萨嘎县",
  "吉隆县",
  "仲巴县",
  "谢通门县"
  ],
 "昌都": [
  "卡若区",
  "江达县",
  "贡觉县",
  "察雅县",
  "左贡县",
  "芒康县",
  "八宿县",
  "洛隆县",
  "边坝县",
  "类乌齐县",
  "丁青县"
  ],
 "林芝": [
  "巴宜区",
  "工布江达县",
  "波密县",
  "朗县",
  "米林县",
  "察隅县",
  "墨脱县"
  ],
 "那曲地区": [
  "巴青县",
  "索县",
  "比如县",
  "嘉黎县",
  "班戈县",
  "那曲县",
  "申扎县",
  "尼玛县",
  "安多县",
  "聂荣县"
  ],
 "阿里地区": [
  "革吉县",
  "改则县",
  "错勤县",
  "噶尔县",
  "普兰县",
  "札达县",
  "日土县"
  ]
 },
"贵州省": {
 "六盘水": [
  "钟山区",
  "六枝特区",
  "水城县",
  "盘县"
  ],
 "安顺": [
  "西秀区",
  "平坝区",
  "紫云县",
  "镇宁县 关岭县",
  "普定县"
  ],
 "毕节": [
  "七星关区",
  "黔西县",
  "大方县",
  "金沙县",
  "织金县",
  "威宁县",
  "赫章县",
  "纳雍县"
  ],
 "贵阳": [
  "南明区",
  "云岩区",
  "白云区",
  "花溪区",
  "乌当区",
  "观山湖区",
  "清镇市",
  "修文县",
  "开阳县",
  "息烽县"
  ],
 "遵义": [
  "红花岗区",
  "汇川区",
  "播州区",
  "赤水市",
  "仁怀市",
  "桐梓县",
  "绥阳县",
  "正安县",
  "道真县",
  "湄潭县",
  "凤岗县",
  "务川县",
  "余庆县",
  "习水县"
  ],
 "铜仁": [
  "碧江区",
  "万山区",
  "玉屏县",
  "江口县",
  "石阡县",
  "印江县",
  "思南县",
  "德江县",
  "沿河县",
  "松桃苗族自治县"
  ],
 "黔东南苗族侗族自治州": [
  "凯里市",
  "黄平县 施秉县",
  "台江县",
  "剑河县 三穗县",
  "天柱县",
  "锦屏县",
  "雷山县",
  "榕江县黎平县",
  "从江县",
  "丹寨县",
  "麻江县",
  "镇远县",
  "岑巩县"
  ],
 "黔南布依族苗族自治州": [
  "都匀市",
  "福泉市",
  "罗甸县",
  "瓮安县",
  "惠水县",
  "长顺县",
  "龙里县",
  "贵定县",
  "独山县",
  "平塘县",
  "荔波县",
  "三都水族自治县"
  ],
 "黔西南布依族苗族自治州": [
  "兴义市",
  "兴仁县",
  "册亨县",
  "望谟县",
  "安龙县",
  "晴隆县",
  "普安县",
  "贞丰县"
  ]
 },
"辽宁省": {
 "丹东": [
  "振兴区",
  "振安区",
  "元宝区",
  "凤城市",
  "东港市",
  "宽甸自治县"
  ],
 "大连": [
  "中山区",
  "西岗区",
  "沙河口区",
  "金州区",
  "甘井子区",
  "旅顺口区",
  "普兰店市",
  "瓦房店市",
  "庄河市",
  "长海县"
  ],
 "抚顺": [
  "新抚区",
  "顺城区",
  "望花区",
  "东洲区",
  "抚顺县",
  "新宾自治县",
  "清原自治县"
  ],
 "朝阳": [
  "双塔区",
  "龙城区",
  "北票市",
  "凌源市",
  "建平县",
  "朝阳县",
  "喀喇沁左翼自治县"
  ],
 "本溪": [
  "平山区",
  "南芬区",
  "明山区",
  "溪湖区",
  "本溪自治县",
  "桓仁自治县"
  ],
 "沈阳": [
  "和平区",
  "沈河区",
  "皇姑区",
  "大东区",
  "铁西区",
  "浑南区",
  "于洪区",
  "沈北新区",
  "苏家屯区",
  "辽中区",
  "新民市",
  "康平县",
  "法库县"
  ],
 "盘锦": [
  "兴隆台区",
  "大洼区",
  "双台子区",
  "盘山县"
  ],
 "营口": [
  "站前区",
  "西市区",
  "老边区",
  "鲅鱼圈区",
  "大石桥市",
  "盖州市"
  ],
 "葫芦岛": [
  "龙港区",
  "连山区",
  "南票区",
  "兴城市",
  "绥中县",
  "建昌县"
  ],
 "辽阳": [
  "白塔区",
  "文圣区",
  "宏伟区",
  "弓长岭区",
  "太子河区",
  "灯塔市",
  "辽阳县"
  ],
 "铁岭": [
  "银州区",
  "清河区",
  "铁岭新城区",
  "调兵山市",
  "开原市",
  "昌图县",
  "铁岭县",
  "西丰县"
  ],
 "锦州": [
  "古塔区",
  "太和区",
  "凌河区",
  "松山新区",
  "龙栖湾新区",
  "经济开发区",
  "凌海市",
  "北镇市",
  "黑山县",
  "义县"
  ],
 "阜新": [
  "海州区",
  "细河门区",
  "新邱区",
  "太平区",
  "清河门区",
  "彰武县",
  "阜新自治县"
  ],
 "鞍山": [
  "铁东区",
  "铁西区",
  "立山区",
  "千山区",
  "海城市",
  "台安县",
  "岫岩自治县"
  ]
 },
"重庆市": {
 "重庆市": [
  "渝中区",
  "渝北区",
  "江北区",
  "南岸区",
  "北碚区",
  "巴南区",
  "涪陵区",
  "綦江区",
  "大足区",
  "长寿区",
  "合川区",
  "永川区",
  "南川区",
  "璧山区",
  "铜梁区",
  "潼南区",
  "荣昌区",
  "万州区",
  "黔江区",
  "沙坪坝区",
  "九龙坡区",
  "大渡口区",
  "江津区",
  "巫山县",
  "巫溪县",
  "丰都县",
  "城口县",
  "垫江县",
  "云阳县",
  "奉节县",
  "武隆县",
  "梁平县",
  "开县",
  "忠县",
  "石柱自治县县",
  "彭水自治县",
  "酉阳自治县",
  "秀山自治县"
  ]
 },
"陕西省": {
 "咸阳": [
  "秦都区",
  "渭城区",
  "兴平市",
  "三原县",
  "淳化县",
  "旬邑县",
  "武功县",
  "礼泉县",
  "乾县",
  "永寿县",
  "彬县",
  "长武县",
  "泾阳县"
  ],
 "商洛": [
  "商州区",
  "柞水县",
  "镇安县",
  "洛南县",
  "丹凤县",
  "商南县",
  "山阳县"
  ],
 "安康": [
  "汉滨区",
  "宁陕县",
  "汉阴县",
  "石泉县",
  "紫阳县",
  "岚皋县",
  "平利县",
  "镇坪县",
  "旬阳县",
  "白河县"
  ],
 "宝鸡": [
  "渭滨区",
  "金台区",
  "陈仓区",
  "千阳县",
  "陇县",
  "凤翔县",
  "麟游县",
  "太白县",
  "凤县",
  "扶风县",
  "眉县",
  "岐山县"
  ],
 "延安": [
  "宝塔区",
  "黄龙县",
  "甘泉县",
  "宜川县",
  "延长县",
  "延川县",
  "子长县",
  "安塞县",
  "志丹县",
  "吴旗县",
  "黄陵县",
  "洛川县",
  "富县"
  ],
 "杨凌": [
  "杨凌区1997年7月咸阳市杨陵区成立杨凌农业高新技术产业示范区",
  "省直辖行政上仍隶属于咸阳市"
  ],
 "榆林": [
  "榆阳区",
  "横山区",
  "绥德县",
  "米脂县",
  "吴堡县",
  "清涧县",
  "子洲县",
  "靖边县",
  "定边县",
  "佳县",
  "神木县",
  "府谷县"
  ],
 "汉中": [
  "汉台区",
  "南郑县",
  "城固县",
  "洋县",
  "佛坪县",
  "西乡县",
  "镇巴县",
  "留坝县",
  "勉县",
  "略阳县",
  "宁强县"
  ],
 "渭南": [
  "临渭区",
  "华州区",
  "韩城市",
  "华阴市",
  "富平县",
  "华县",
  "潼关县",
  "大荔县",
  "澄城县",
  "合阳县",
  "蒲城县",
  "白水县"
  ],
 "西安": [
  "未央区",
  "长安区",
  "新城区",
  "莲湖区",
  "灞桥区",
  "雁塔区",
  "高陵区",
  "碑林区",
  "临潼区",
  "阎良区",
  "户县",
  "周至县",
  "蓝田县"
  ],
 "铜川": [
  "王益区",
  "印台区",
  "耀州区",
  "宜君县"
  ]
 },
"青海省": {
 "果洛藏族自治州": [
  "玛多县",
  "甘德县",
  "达曰县",
  "班玛县",
  "玛沁县",
  "久治县"
  ],
 "海东": [
  "乐都区",
  "平安区",
  "互助土族自治县",
  "民和回族自治县",
  "化隆回族自治县",
  "循化撒拉族自治县"
  ],
 "海北藏族自治州": [
  "海晏县",
  "祁连县",
  "刚察县",
  "门源回族自治县"
  ],
 "海南藏族自治州": [
  "贵德县",
  "贵南县",
  "同德县",
  "兴海县",
  "共和县"
  ],
 "海西": [
  "德令哈市",
  "格尔木市",
  "都兰县",
  "乌兰县 天峻县"
  ],
 "玉树藏族自治州": [
  "玉树市",
  "称多县",
  "囊谦县",
  "杂多县",
  "治多县",
  "曲麻菜县"
  ],
 "西宁": [
  "城中区",
  "城东区",
  "城西区",
  "城北区",
  "湟中县",
  "湟源县",
  "大通回族自治县",
  ""
  ],
 "黄南藏族自治州": [
  "同仁县",
  "尖扎县",
  "泽库县",
  "河南蒙古族自治县"
  ]
 },
"黑龙江省": {
 "七台河": [
  "桃山区",
  "新兴区",
  "茄子河区",
  "勃利县"
  ],
 "伊春": [
  "伊春区",
  "翠峦区",
  "南岔区",
  "乌马河区",
  "金山屯区",
  "新青区",
  "美溪区",
  "红星区",
  "汤旺河区",
  "上甘岭区",
  "西林区",
  "五营区",
  "友好区",
  "乌伊岭区",
  "带岭区",
  "铁力市",
  "嘉荫县"
  ],
 "佳木斯": [
  "前进区",
  "向阳区",
  "东风区",
  "郊区",
  "同江市",
  "富锦市",
  "抚远市",
  "桦川县",
  "桦南县",
  "汤原县"
  ],
 "双鸭山": [
  "尖山区",
  "岭东区",
  "四方台区",
  "宝山区",
  "宝清县",
  "饶河县",
  "友谊县",
  "集贤县"
  ],
 "哈尔滨": [
  "松北区",
  "道里区",
  "道外区",
  "南岗区",
  "平房区",
  "呼兰区",
  "双城区",
  "香坊区",
  "阿城区",
  "五常市",
  "尚志市",
  "宾县",
  "延寿县",
  "方正县",
  "通河县",
  "巴彦县",
  "木兰县",
  "依兰县"
  ],
 "大兴安岭": [
  "加格达奇区",
  "松岭区",
  "新林区",
  "呼中区",
  "呼玛县",
  "塔河县",
  "漠河县"
  ],
 "大庆": [
  "萨尔图区",
  "红岗区",
  "大同区",
  "龙凤区",
  "让胡路区",
  "林甸县",
  "肇州县",
  "肇源县",
  "杜尔伯特自治县"
  ],
 "牡丹江": [
  "东安区",
  "阳明区",
  "爱民区",
  "西安区",
  "绥芬河市",
  "海林市",
  "东宁市",
  "宁安市",
  "穆棱市",
  "林口县"
  ],
 "绥化": [
  "北林区",
  "肇东市",
  "安达市",
  "海伦市",
  "兰西县",
  "青冈县",
  "明水县",
  "望奎县",
  "绥棱县",
  "庆安县"
  ],
 "鸡西": [
  "鸡冠区",
  "城子河区",
  "恒山区",
  "滴道区",
  "梨树区",
  "麻山区",
  "密山市",
  "虎林市",
  "鸡东县"
  ],
 "鹤岗": [
  "兴山区",
  "向阳区",
  "工农区",
  "兴安区",
  "南山区",
  "东山区",
  "萝北县",
  "绥滨县"
  ],
 "黑河": [
  "爱辉区",
  "北安市",
  "五大连池市",
  "孙吴县",
  "逊克县",
  "嫩江县"
  ],
 "齐齐哈尔": [
  "龙沙区",
  "铁峰区",
  "建华区",
  "梅里斯达斡尔族区",
  "昂昂溪区",
  "碾子山区",
  "富拉尔基区",
  "讷河市",
  "龙江县",
  "富裕县",
  "依安县",
  "克山县",
  "甘南县",
  "泰来县",
  "拜泉县",
  "克东县"
  ]
 }
}
